In case of trying to provide compatible instance type for `default-pool` we are experience issue that node pool is always trying to be recreated each time `terraform apply` executed, probably it tries to create it again each time (but it should be handled with `remove_default_node_pool` config):

example:
```tf
resource "google_container_cluster" "primary" {
  name     = "my-gke-cluster"
  location = "europe-west1"

  # We can't create a cluster with no node pool defined, but we want to only use
  # separately managed node pools. So we create the smallest possible default
  # node pool and immediately delete it.
  remove_default_node_pool = true

  node_pool {
    name = "default-pool"
    node_config {
      machine_type = "n2d-standard-2"
    }
  }
}
```

Output:
```
google_container_cluster.primary: Refreshing state... [id=projects/***/locations/europe-west1/clusters/my-gke-cluster]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.primary must be replaced
-/+ resource "google_container_cluster" "primary" {
      ~ cluster_ipv4_cidr           = "10.204.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
...
      + node_pool { # forces replacement
          + initial_node_count          = (known after apply)
          + instance_group_urls         = (known after apply)
          + managed_instance_group_urls = (known after apply)
          + max_pods_per_node           = (known after apply)
          + name                        = "default-pool" # forces replacement
          + name_prefix                 = (known after apply)
          + node_count                  = (known after apply)
          + node_locations              = (known after apply)
          + version                     = (known after apply)
...
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```